app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes"  ORDER BY "school_classes"."id" ASC LIMIT 1
---
  def index
    @classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "math"], ["created_at", "2017-11-08 02:11:03.939522"], ["updated_at", "2017-11-08 02:11:03.939522"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class))
    @school_class.save

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @school_class = SchoolClass.find(params[:id])

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 102], ["updated_at", "2017-11-08 02:50:38.850362"], ["id", 3]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:school_class))