app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students"

  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordan edited"], ["updated_at", "2017-11-08 01:47:58.394775"], ["id", 1]]